
Перем ВебСокетКлиент Экспорт;


Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
//	
//	Текст = WebSocketКлиент.Base64ВСтроку(Данные); 
//
//	СтруктураСообщения = WebSocketСервер.ПолучитьСтруктуруСообщения(Текст);
//
//	ОчередьСообщений.Вставить(0, СтруктураСообщения);
//	
//	Если ОчередьСообщений.Количество() = 1 ТОгда
//		WebSocketКлиент.ОбработатьОчередьСообщений();	
//	КонецЕсли;
//	
//	//ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
//	
//	//Сообщить(Строка(ГлобальныйСчетчик) + ": " + СтруктураСообщения.name + ": " + СтруктураСообщения.message + " : " + СтруктураСообщения.uuid + " : " + СтруктураСообщения.uuid_channel);
	
	
КонецПроцедуры


Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	Если ВебСокетКлиент <> Неопределено Тогда
		ВебСокетКлиент.Закрыть();
		ВебСокетКлиент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриНачалеРаботыСистемы()

	Если WebSocketСервер.РазрешитьИспользование() Тогда   
		ПодключитьКомпонентуWebSocketService();
	КонецЕсли;

	
КонецПроцедуры // ПриНачалеРаботыСистемы()

Асинх Процедура ПодключитьКомпонентуWebSocketService()
	
	Подключена = Ждать WebSocketКлиент.ПодключитьКлиента();
	
	Если НЕ Подключена Тогда  
		ВебСокетКлиент = Неопределено;
		Возврат;
	КонецЕсли;
	
    WebSocketКлиент.СтартоватьСервис(Истина);
	
КонецПроцедуры

