
Перем ВебСокетКлиент Экспорт;
Перем ОчередьСообщений Экспорт;

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	ОбщегоНазначения.УстановитьПараметрыСеанса();
	
	ПодключитьКомпоненту();
	
КонецПроцедуры

Асинх Процедура ПодключитьКомпоненту()
	
	КомпонетПодлкючен = Ждать WebSocketКлиент.ПодключитьКлиента();
	ОчередьСообщений = Новый Массив();
	
	Если НЕ КомпонетПодлкючен Тогда
		Возврат;
	КонецЕсли;
	
	ВебСокетКлиент = WebSocketКлиент.ПолучитьОбъект();
	
	Если ВебСокетКлиент <> Неопределено Тогда
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		Если Пользователь = Неопределено ТОгда
			Пользователь = "Пользователь 1С";
		КонецЕсли;
		
		ПараметрыПодключения = ОбщегоНазначения.ПолучитьНастройкиПодключения();
		ВебСокетКлиент.Сервер = ПараметрыПодключения.Сервер;
		ВебСокетКлиент.Порт = ПараметрыПодключения.Порт;
		ВебСокетКлиент.ОткрытьКак(ПараметрыПодключения.UUID, Пользователь);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	
	Текст = WebSocketКлиент.Base64ВСтроку(Данные); 

	СтруктураСообщения = WebSocketСервер.ПолучитьСтруктуруСообщения(Текст);

	ОчередьСообщений.Вставить(0, СтруктураСообщения);
	
	Если ОчередьСообщений.Количество() = 1 ТОгда
		WebSocketКлиент.ОбработатьОчередьСообщений();	
	КонецЕсли;
	
	//ГлобальныйСчетчик = ГлобальныйСчетчик + 1;
	
	//Сообщить(Строка(ГлобальныйСчетчик) + ": " + СтруктураСообщения.name + ": " + СтруктураСообщения.message + " : " + СтруктураСообщения.uuid + " : " + СтруктураСообщения.uuid_channel);
	
	
КонецПроцедуры


Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	Если ВебСокетКлиент <> Неопределено Тогда
		ВебСокетКлиент.Закрыть();
		ВебСокетКлиент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
