
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДеревоГрупп") Тогда
		ЗначениеВРеквизитФормы(Параметры.ДеревоГрупп, "ДеревоГрупп");
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьДерево(Дерево, ДеревоИсточник)
//	Для Каждого ТекСтрока Из ДеревоИсточник.Строки Цикл
//		НоваяСтрока = Дерево.Строки.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
//		ЗаполнитьДерево(НоваяСтрока, ТекСтрока);
//	КонецЦикла;
//КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПолучитьВыбранноеЗначение());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыбранноеЗначение()
	
	ТекущаяСтрока = Элементы.ДеревоГрупп.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ДанныеСтроки = ДеревоГрупп.НайтиПоИдентификатору(ТекущаяСтрока);
		Возврат Новый Структура("ИдентификаторГруппы", ДанныеСтроки.Ref);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДеревоГруппВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = ДеревоГрупп.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Закрыть(Новый Структура("ИдентификаторГруппы", ДанныеСтроки.Ref));
КонецПроцедуры
