
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДеревоГрупп") Тогда
		мДеревоГрупп = Неопределено;
		Если ЭтоАдресВременногоХранилища(Параметры.ДеревоГрупп) Тогда
			мДеревоГрупп = ПолучитьИзВременногоХранилища(Параметры.ДеревоГрупп);
		КонецЕсли;
		Если мДеревоГрупп <> Неопределено Тогда
			ЗначениеВРеквизитФормы(мДеревоГрупп, "ДеревоГрупп");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПолучитьВыбранноеЗначение());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыбранноеЗначение()
	
	ТекущаяСтрока = Элементы.ДеревоГрупп.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ДанныеСтроки = ДеревоГрупп.НайтиПоИдентификатору(ТекущаяСтрока);
		Возврат Новый Структура("ИдентификаторГруппы", ДанныеСтроки.Ref);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДеревоГруппВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеСтроки = ДеревоГрупп.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Закрыть(Новый Структура("ИдентификаторГруппы", ДанныеСтроки.Ref));
КонецПроцедуры
