
Процедура УстановитьПараметрыСеанса() Экспорт
	
	ПараметрыСеанса.ИдентификаторПриложения = Новый УникальныйИдентификатор();

	Если СокрЛП(Константы.Сервер.Получить()) <> "" Тогда
		ПараметрыСеанса.ВебСокетСервер = Константы.Сервер.Получить();	
	Иначе
		ПараметрыСеанса.ВебСокетСервер = "127.0.0.0"
	КонецЕсли;
	
	Если Константы.Порт.Получить() > 0 Тогда
		ПараметрыСеанса.ПортВебСокетСервера = Константы.Порт.Получить();
	Иначе
		ПараметрыСеанса.ПортВебСокетСервера = 8080;
	КонецЕсли;
	

КонецПроцедуры

Функция ПолучитьНастройкиПодключения() Экспорт
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("UUID", Строка(ПараметрыСеанса.ИдентификаторПриложения));
	СтруктураРезультат.Вставить("Сервер", ПараметрыСеанса.ВебСокетСервер);
	СтруктураРезультат.Вставить("Порт", ПараметрыСеанса.ПортВебСокетСервера);
	
	Возврат СтруктураРезультат;
	
КонецФункции

Функция ПолучитьДанныеУчетнойЗаписи(ВыбПользователь = Неопределено) Экспорт

	ТекущийПользователь = Неопределено;

	Если ВыбПользователь = Неопределено Тогда
		ТекущийПользователь = ПользователиСервер.АвторизованныйПользователь();
	Иначе
		ТекущийПользователь = ВыбПользователь.Ссылка;
	КонецЕсли;

	Если ТипЗнч(ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	Справочник.УчетныеЗаписиПользователей КАК УчетныеЗаписиПользователей
			|ГДЕ
			|	УчетныеЗаписиПользователей.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		СтруктураУчетнойЗаписи = Новый Структура();
		СтруктураУчетнойЗаписи.Вставить("Пользователь", СокрЛП(ТекущийПользователь));
		СтруктураУчетнойЗаписи.Вставить("Пароль", "");
		СтруктураУчетнойЗаписи.Вставить("ИдентификаторПользователя", "");
		СтруктураУчетнойЗаписи.Вставить("Имя", ТекущийПользователь.Код);
		СтруктураУчетнойЗаписи.Вставить("Представление", "");
				
		Если Выборка.Следующий() Тогда
			СтруктураУчетнойЗаписи.Пароль = Выборка.Пароль;
			СтруктураУчетнойЗаписи.ИдентификаторПользователя = XMLСтрока(ТекущийПользователь);
			//СтруктураУчетнойЗаписи.Представление = Выборка.Представление;
		КонецЕсли;
		Возврат СтруктураУчетнойЗаписи;
	Иначе
		Возврат Справочники.УчетныеЗаписиПользователей.ПустаяСсылка();
	КонецЕсли;

КонецФункции
