
Процедура УстановитьПараметрыСеанса() Экспорт
	
	ПараметрыСеанса.ИдентификаторПриложения = Новый УникальныйИдентификатор();

	Если СокрЛП(Константы.Сервер.Получить()) <> "" Тогда
		ПараметрыСеанса.ВебСокетСервер = Константы.Сервер.Получить();	
	Иначе
		ПараметрыСеанса.ВебСокетСервер = "127.0.0.0"
	КонецЕсли;
	
	Если Константы.Порт.Получить() > 0 Тогда
		ПараметрыСеанса.ПортВебСокетСервера = Константы.Порт.Получить();
	Иначе
		ПараметрыСеанса.ПортВебСокетСервера = 8080;
	КонецЕсли;
	

КонецПроцедуры

Функция ПолучитьНастройкиПодключения() Экспорт
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("UUID", Строка(ПараметрыСеанса.ИдентификаторПриложения));
	СтруктураРезультат.Вставить("Сервер", ПараметрыСеанса.ВебСокетСервер);
	СтруктураРезультат.Вставить("Порт", ПараметрыСеанса.ПортВебСокетСервера);
	
	Возврат СтруктураРезультат;
	
КонецФункции
