
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Если ВебСокетКлиент.Запущен() Тогда
		ВебСокетКлиент.Сообщить(ТекстСообщения, ПолучательИдентификатор, Строка(УникальныйИдентификатор));
	КонецЕсли;  
	ТекстСообщения = "";
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВебСокетКлиент = Неопределено Тогда
		Отказ = Истина
	Иначе
		Если НЕ ВебСокетКлиент.Запущен() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;   
	
	Если Отказ ТОгда
		Предупреждение("Клинет не подключен!")
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
		Текст = арс_РаботаСWebSocketКлиент.Base64ВСтроку(Данные);
	
	СообщитьАсинхронно(Текст);
	
	СтруктураСообщения = арс_РаботаСWebSocketСервер.ПолучитьСтруктуруСообщения(Текст);
	
	Если СтруктураСообщения.result = "error" Тогда
		Сообщить(СтруктураСообщения.message, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Если СтруктураСообщения.Свойство("uuid_form") Тогда
		Если СокрЛП(СтруктураСообщения.uuid_form) <> "" И НЕ Новый УникальныйИдентификатор(СтруктураСообщения.uuid_form) = УникальныйИдентификатор Тогда
			Возврат;  
		Иначе
			Если СокрЛП(СтруктураСообщения.uuid_form) = "" Тогда
				Сообщить(СтруктураСообщения.message); 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли; 

	Если СтруктураСообщения.command <> "message" Тогда 
		Если СтруктураСообщения.command = "get_messages" Тогда
			ЗагрузитьСообщения(СтруктураСообщения.message);
			ВебСокетКлиент.ПолучитьИнформациюОПользователе(ПолучательИдентификатор, Строка(УникальныйИдентификатор));	
		ИначеЕсли СтруктураСообщения.command = "get_user_info" Тогда 
			ИнформацияОПользователе = арс_РаботаСJSON.ЗаполнитьСтруктуруИзОтветаJSON(СтруктураСообщения.message);
			Если ТипЗнч(ИнформацияОПользователе) = Тип("Структура") Тогда
				Если ИнформацияОПользователе.Свойство("performance") ТОгда
					ЭтаФорма.Заголовок = "Чат: " + ИнформацияОПользователе.performance + "(" + ?(ИнформацияОПользователе.active, "В сети", "Не в сети" + ")");	
				Иначе
					ЭтаФорма.Заголовок = "Чат: " + ИнформацияОПользователе.name + "(" + ?(ИнформацияОПользователе.active, "В сети", "Не в сети") + ")";
				КонецЕсли;
				АктивностьПолучателя = ИнформацияОПользователе.active;
			КонецЕсли;
		ИначеЕсли СтруктураСообщения.command = "client_leave" Тогда
			ВебСокетКлиент.ПолучитьИнформациюОПользователе(ПолучательИдентификатор, Строка(УникальныйИдентификатор));
		КонецЕсли;
	Иначе 
		ОбработатьСообщениеСервера(СтруктураСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСообщения(ОтветСервера)
	
	ОчиститьСписок();
	
	мСообщения = арс_РаботаСJSON.ЗаполнитьСтруктуруИзОтветаJSON(ОтветСервера);
	
	Если ТипЗнч(мСообщения) = Тип("Массив") Тогда
		Для Каждого Элемент Из мСообщения Цикл
		     СтруктураСообщения = арс_РаботаСJSON.ЗаполнитьСтруктуруИзОтветаJSON(арс_РаботаСWebSocketКлиент.Base64ВСтроку(Элемент.message)); 
			 ОбработатьСообщениеСервера(СтруктураСообщения,  Дата(1970,1,1,1,0,0) + Элемент.date + ВебСокетКлиент.ПолучитьСмещениеВременнойЗоны());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписок()   
	
	ДокументПервогоБраузера = ЭлементыФормы.ПолеHTML.Документ;
    ОкноДокумента     = ДокументПервогоБраузера.parentWindow; // IE
    Если ОкноДокумента = Неопределено Тогда
        ОкноДокумента = ДокументПервогоБраузера.defaultView; // Прочие браузеры
	КонецЕсли;
	
	ОкноДокумента.clear_list();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьСообщениеСервера(СтруктураСообщения, ДатаСообщения = Неопределено)
	
	Если СтруктураСообщения.result = "error" Тогда
		Сообщить("Ошибка: " + СтруктураСообщения.message, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	//Команда = СтруктураСообщения.command;
	
	//ОкноДокумента =	ЭлементыФормы.ПолеHTML.Документ.defaultView;
	//Если ОкноДокумента = Неопределено Тогда
	//    Возврат;
	//КонецЕсли;
	ДокументПервогоБраузера = ЭлементыФормы.ПолеHTML.Документ;
    ОкноДокумента     = ДокументПервогоБраузера.parentWindow; // IE
    Если ОкноДокумента = Неопределено Тогда
        ОкноДокумента = ДокументПервогоБраузера.defaultView; // Прочие браузеры
	КонецЕсли;
	
	Если ДатаСообщения = Неопределено Тогда
		ДатаСообщения = ТекущаяДата();
	КонецЕсли;
	
	ОкноДокумента.push_message(Формат(ДатаСообщения, "ДЛФ=DT") + " " + СтруктураСообщения.name + ":" + СтруктураСообщения.message);
	
КонецПроцедуры

