
Асинх Функция ПодключитьКлиента() Экспорт
	
	Результат = Ждать wsПодключитьКлиента();

	Возврат Результат;
	
КонецФункции


Функция ЭтоЛинкус()
 	Инф = Новый СистемнаяИнформация();
	Возврат Инф.ТипПлатформы = ТипПлатформы.Linux_x86_64;
КонецФункции

Асинх Функция wsПодключитьКлиента()
	
	Местоположение = WebSocketСервер.ПолучитьМестоположение(ЭтоЛинкус());
		 
	Файл = Новый Файл(Местоположение);
	Если НЕ Файл.Существует() Тогда
		ВызватьИсключение "Файл компоненты не найден!"
	КонецЕсли;
		 
	Результат = Ждать ПодключитьВнешнююКомпонентуАсинх(Местоположение, "arc", ТипВнешнейКомпоненты.Native); 	
			
	Если Результат ТОгда 	
		wsКлиент = Новый ("AddIn.arc." + WebSocketСервер.ПолучитьИдентификаторОбъекта()); //("AddIn.arc.WebSocketClient");	 
		wsКлиент = Неопределено;
		Сообщить("Внешняя компонента успешно подключена!");
	Иначе
		ВызватьИсключение "Ошибка подключения внешней компоненты!";
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

Функция ПолучитьОбъект() Экспорт
	Результат = Неопределено;
	Попытка
		Результат =  Новый ("AddIn.arc." + WebSocketСервер.ПолучитьИдентификаторОбъекта());
	Исключение
		
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция Base64ВСтроку(Base64) Экспорт
	
	Текст = "";
	
	ДвоичныеДанные = Base64Значение(Base64);
	Если ДвоичныеДанные = Неопределено Тогда
		Текст = Base64;
	Иначе
		Текст = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьПолныйИдентификаторОбъекта() Экспорт
	Возврат "AddIn.arc." + WebSocketСервер.ПолучитьИдентификаторОбъекта();
КонецФункции

&НаКлиенте
Асинх Процедура ОбработатьОчередьСообщений() Экспорт
	
//	Пока ОчередьСообщений.Количество() > 0 Цикл
		
//		СтруктураСообщения = ОчередьСообщений.Получить(0);
		
//		СтруктураКлиента = wsКлиент.Получить(СтруктураСообщения.uuid);
		
//		Клиент = Неопределено;
//		ПутьКДанным = Неопределено;
//				
//		Если СтруктураКлиента <> Неопределено Тогда
//			Клиент = СтруктураКлиента.Клиент;
//			ПутьКДанным = СтруктураКлиента.ПутьКДанным;
//		КонецЕсли;
//		
//		Если Клиент <> Неопределено Тогда
//			
//		КонецЕсли;
//		
//		Если ПутьКДанным <> Неопределено Тогда
//			ОбновитьЭлемент(ПутьКДанным, СтруктураСообщения.message, СтруктураСообщения.name);
//		КонецЕсли;
//				
//		Если СтруктураСообщения.Свойство("uuid_channel") Тогда
//			Если НЕ ЭтоПустойUUID(СтруктураСообщения.uuid_channel) Тогда
//			
//			Иначе
//			
//			КонецЕсли;
//		КонецЕсли;

//		Оповестить("ВебСокетСообщение", СтруктураСообщения, Неопределено);
		
//		ОчередьСообщений.Удалить(0);	
			
//	КонецЦикла;

КонецПроцедуры

