
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьНастройкиWebSockets();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНастройкиWebSockets();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкиWebSockets()

	Настройки = WebSocketСервер.ПолучитьНастройки();

	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоНастроек = РеквизитФормыВЗначение("ДеревоНастройкиWebSockets", Тип("ДеревоЗначений"));
	РаботаСJSON.СтруктураВДеревоЗначений(Настройки, ДеревоНастроек);
	ЗначениеВРеквизитФормы(ДеревоНастроек, "ДеревоНастройкиWebSockets");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры



&НаСервере
Процедура ЗаписатьНастройкиWebSockets()

	ДеревоНастроек = РеквизитФормыВЗначение("ДеревоНастройкиWebSockets", Тип("ДеревоЗначений"));
	СтруктураНастроек = РаботаСJSON.ДеревоЗначенийВСтруктуру(ДеревоНастроек);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, СтруктураНастроек);
	
	НоваяНастройка = Запись.Закрыть();
	Если НоваяНастройка <> ПараметрыСеанса.НастройкаWebSockets ТОгда
		
		мНаборКонстант = РеквизитФормыВЗначение("НаборКонстант");
		
		мНаборКонстант.НастройкаWebSockets = НоваяНастройка;
		
		ЗначениеВРеквизитФормы(мНаборКонстант, "НаборКонстант");
		
	КонецЕсли;
	
КонецПроцедуры


