
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ИмяГруппы", ИмяГруппы);
	Параметры.Свойство("ПредставлениеГруппы", ПредставлениеГруппы);
	Параметры.Свойство("Родитель", Родитель);
	Параметры.Свойство("ЭтоНовый", ЭтоНовый);
	Параметры.Свойство("ИдентификаторРодителя", ИдентификаторРодителя);
	Параметры.Свойство("Идентификатор", Идентификатор);     
	
	ЭтаФорма.Заголовок = ?(ЭтоНовый, ЭтаФорма.Заголовок + " (Новая группа)", ЭтаФорма.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если СокрЛП(ПредставлениеГруппы) = "" ТОгда
		ПредставлениеГруппы = ИмяГруппы;
	КонецЕсли;

	Закрыть(Новый Структура("ИмяГруппы,ПредставлениеГруппы,Родитель,ЭтоНовый,Родитель,ИдентификаторРодителя,Идентификатор",
	ИмяГруппы, ПредставлениеГруппы, ИдентификаторГруппы, ЭтоНовый, Родитель, ИдентификаторРодителя, Идентификатор));
КонецПроцедуры

&НаКлиенте
Процедура ИмяГруппыПриИзменении(Элемент)
	Если СокрЛП(ПредставлениеГруппы) = "" ТОгда
		ПредставлениеГруппы = ИмяГруппы;
	КонецЕсли;
КонецПроцедуры
