
Функция ЭтоРежимОтладки() Экспорт
	Возврат Константы.РежимОтладки.Получить()
КонецФункции

Функция ПолучитьМестоположение(_ЭтоЛинкус) Экспорт

	Если ЭтоРежимОтладки() Тогда
		Разделитель = ?(_ЭтоЛинкус, "/", "\");
		мКаталогОтладки = СтрРазделить(Константы.КаталогОтладки.Получить(), "|");
		КаталогОтладки = ?(_ЭтоЛинкус, мКаталогОтладки[0], мКаталогОтладки[1]);
		мИмяКомпоненты = СтрРазделить(Константы.ИмяВнешнейКомпоненты.Получить(), "|");
		ИмяКомпоненты = ?(_ЭтоЛинкус, мИмяКомпоненты[0], мИмяКомпоненты[1]);
		Возврат КаталогОтладки + Разделитель + ИмяКомпоненты;
	Иначе
		Возврат "ОбщийМакет.ws_client";
	КонецЕсли
	
КонецФункции


Функция ПолучитьИдентификаторОбъекта() Экспорт
	Возврат Константы.ИдентификаторОбъекта.Получить();
КонецФункции

Функция ПолучитьСообщение(jsonТекст) Экспорт
	Попытка	
		Чтение = Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(jsonТекст);
		Значение = ПрочитатьJSON(Чтение);
		
		Результат = "";
		
		Если Значение.Свойство("name") Тогда
			Результат = Значение.name + ": 
			|";
		КонецЕсли;
		
		Если Значение.Свойство("message") ТОгда
			Результат = Результат + Значение.message;
		КонецЕсли;
		Возврат Результат;	
	Исключение
		Возврат jsonТекст;
	КонецПопытки;
КонецФункции

Функция ПолучитьСтруктуруСообщения(jsonТекст) Экспорт
	Попытка	
		Чтение = Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(jsonТекст);
		Значение = ПрочитатьJSON(Чтение);
		Возврат Значение;
	Исключение
		Возврат Новый Структура();
	КонецПопытки;
КонецФункции