ТекстЗапроса = Новый Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка,
	|	Пользователи.Родитель,
	|	Пользователи.Код,
	|	Пользователи.Наименование,
	|	Пользователи.ЭтоГруппа
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления";
	
Результат = Запрос.Выполнить();

Выборка = Результат.Выбрать();

Запись = Новый ЗаписьJSON();
Запись.УстановитьСтроку();

МассивСтрок = Новый Массив();

Пока Выборка.Следующий() Цикл

	СтруктураСтроки = Новый Структура();
	СтруктураСтроки.Вставить("uuid", XMLСтрока(Выборка.Ссылка)));
	СтруктураСтроки.Вставить("parent", XMLСтрока(Выборка.Родитель)));
	СтруктураСтроки.Вставить("name", СокрЛП(Выборка.Код)));
	СтруктураСтроки.Вставить("perf", СокрЛП(Выборка.Наименование)));
	СтруктураСтроки.Вставить("is_group", XMLСтрока(Выборка.ЭтоГруппа)));
    //СтруктураСтроки.Вставить("password", Выборка.Пароль)); // если хранится в базе (не обязательно, будет сформирован sha1 пары ИмяПользователяПароль и далее будет использоваться для аутентификации)
    //СтруктураСтроки.Вставить("hash", Выборка.Хеш)); // sha1 пары ИмяПользователяПароль (можно хранить в базе для автоматической аутентификации) если указан - пароль игнорируется
	МассивСтрок.Добавить(СтруктураСтроки);

КонецЦикла;

СериализаторXDTO.ЗаписатьXML(Запись, МассивСтрок);

Результат = ЗаписьЗакрыть();

//Исползование:
//Процедура ВыполнитьСкрипт(Результат = Неопределено, ТекстСкрипта)
//	Выполнить(ТекстСкрипта);
//КонецПроцедуры