&НаКлиенте
Перем wsКлиент, СтруктураПодключения;

&НаКлиенте
Процедура ОтправитьСоообщение(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Подключится(Команда)
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбораПользователя", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.Чат.Форма.ФормаВыбораПользователя", , ЭтаФорма, ,,, ОписаниеОповещенияОЗакрытии);	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработкаВыбораПользователя(Результат, ДополнительныеПараетры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда		
		Если Ждать WebSocketКлиент.ПодключитьКлиента() Тогда	
			wsКлиент = WebSocketКлиент.ПолучитьОбъект();
			СтруктураПодключения = Результат;
			СтруктураПодключения.Вставить("Сервер", wsКлиент.Сервер);
			СтруктураПодключения.Вставить("Порт", wsКлиент.Порт);
			wsКлиент.ОткрытьКак(Результат.UUID, Результат.ИмяПользователя);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Текст = WebSocketКлиент.Base64ВСтроку(Данные); 

	Текст = WebSocketСервер.ПолучитьСообщение(Текст);

	Чат = Чат + Текст + Символы.ПС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если wsКлиент <> Неопределено ТОгда		
		wsКлиент.Закрыть();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отключится(Команда)
	Если wsКлиент <> Неопределено ТОгда
		wsКлиент.Закрыть();	
	КонецЕсли;
КонецПроцедуры




